#!/usr/bin/python
# -*- coding: UTF-8 -*-

import random

# 随机插入一些整数至序列内，并从大到小排列
hardExam = [45,72,36,654,63,653]
newRandom = random.randint(0,9999)
countLenHardExam = len(hardExam)

while countLenHardExam < 10:
    hardExam.insert(0,newRandom)
    countLenHardExam = len(hardExam)

# hardExam.sort()
print hardExam


# 从列表内计算出某个值是那两个数值的积




n = hardExam
m = hardExam

x = 0
y = 1



while n[x] * 654 == 23544:
    x = x+1
    del n[0]
    print n[0]
    print x


#    if len(n) < len(hardExam):
#        n.append(x)
#        x = x + 1
#        print n








#print hardExam[answerA]
#print hardExam[answerB]

#print hardExam[0]
#print hardExam



> 我一直觉得生活在国外的童鞋活的更轻松，不单指是生活压力，还有国外更成熟的沟通习惯和相处模式。大部分人都愿意分享自己的想法，人和人之间没有太多的猜疑。

前几天看了一场电影 - 春娇救志明，我觉得影片把一种伴侣之间理想的相处模式用春娇和志明的生活作为模板搬到了荧幕上，这种相处方式关乎相互尊重、分享生活、解决问题还有如何在日常的相处之中构建亲密关系。

两个人从相知、相遇、相恋乃至之后的结婚、生子、育儿还有相守到老、本来就是由无数生活的琐事联结在一起的。在激情之后如何面对生活的琐事，如何磨合适应有对方的生活，这些都是两个成熟的个体需要一起来考虑的问题，也是一个好的相处模式应当解决的问题。

在电影结束之后我刷新了关于良好的项目模式的想法，做一个简单的记录~
1. 谈论自己过去的经历和想法：适当的分享自己落魄的、不为人知的经历会让两个人间应当是充分信任的，你不需要担心分享这些幼稚的经历会不会让自己受伤，也不需要担心你的另一半会因为这些经历来嘲笑你；

2. 分享自己喜欢的东西给对方而不需要担心对方理不理解，无论是四驱车还是兵人、或者香水或者口红或者更冷门一点的，只要是你觉得能给你带来乐趣、带来成就感的任何东西，不必要求对方必须要和你一起沉醉其中去享受这件事情的乐趣，重点是这个分享的过程让你们更加亲密更加了解对方，说不定什么时候就能给你带来一点小惊喜；

3. 分享自己内心的想法：每个人所看见的，或者说所经历的不一定是事实，说出自己看见的内容和自己的想法，哪怕出现分歧和争吵，无论什么样的沟通方式永远都比闷在心里不说要好。

4. 相互尊重：两个人之间相互尊重对方的圈子和一些无伤大雅的小秘密，把对对方的感觉和主权宣布给朋友，让朋友知道他/她的存在，不仅仅是为了宣布主权，也能给对方带来安全感，感情出现问题了也有一个能够讨论的人有需要的时候还可以一起去参加对方圈子里的一些有意义的事情

5. 意见分歧时的解决方案，无论成熟或者幼稚，但是一定是两个人都同意的解决方案。

